r2/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "image_url" = ?, "color" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_url", "https://www.manufactum.com/aluminum-mechanical-pencil-5-mm-lead-p1520245/"], ["color", "Red"], ["updated_at", "2019-04-03 14:16:13.721665"], ["id", 3]]