r2/app/controllers/simple_pages_controller.rb

SELECT  "products".* FROM "products" LIMIT ?  [["LIMIT", 3]]
---
  def landing_page
    @products=Product.limit(3)